app/views/poll/show.html.erb


    <% @poll.choices.each do |choice|%>
---
SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = ?  [["poll_id", 34]]