app/controllers/poll_controller.rb

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", nil]]
---
	def show
		@poll = Poll.find(params[:id])

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "polls" SET "selected_choice_id" = ?, "updated_at" = ? WHERE "polls"."id" = ?  [["selected_choice_id", 124], ["updated_at", "2016-06-09 07:35:15.508859"], ["id", 72]]
---
	def vote
		puts 'xxxxxxx' + params.to_s

  		@poll = Poll.find(params[:id])
  		@poll.selected_choice_id = params[:radio]
#assign value


		if @poll.save

INSERT INTO "polls" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "{\"name\"=>\"ww\", \"choice\"=>{\"name\"=>\"fgdg\"}}"], ["created_at", "2016-06-07 05:09:06.089778"], ["updated_at", "2016-06-07 05:09:06.089778"]]
---
	def create

		@poll = Poll.new(poll_params)


  		#4.times { @poll.choice.build }
  		#puts params.to_h
		#poll = Poll.new(name: params[:poll][:name])
		#poll.choices = params[:poll][:choices]


		#poll = params.require(:poll).permit(:name,:Cone, :Ctwo, :Cthree,:Cfour )
		 #choices_attributes: [:id,:Cone, :Ctwo, :Cthree])
		#poll.choices = params[:poll][:choices]

		if @poll.save

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 76]]
---
	def show_vote
		@poll = Poll.find(params[:id])